{
  "format": "layers-model",
  "generatedBy": "manual-exporter",
  "convertedBy": "Python 3.11",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "lightweight_autoencoder",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batchInputShape": [
              null,
              20
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "input_layer_3"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_9",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "units": 16,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": {
              "module": "keras.regularizers",
              "class_name": "l2",
              "config": {
                "l2": 0.001
              },
              "registered_name": null
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization_6",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_6",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "rate": 0.3,
            "seed": null,
            "noise_shape": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "latent",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "units": 8,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": {
              "module": "keras.regularizers",
              "class_name": "l2",
              "config": {
                "l2": 0.001
              },
              "registered_name": null
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_10",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "units": 16,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": {
              "module": "keras.regularizers",
              "class_name": "l2",
              "config": {
                "l2": 0.001
              },
              "registered_name": null
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization_7",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_7",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "rate": 0.3,
            "seed": null,
            "noise_shape": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_11",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "units": 20,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": {
              "module": "keras.regularizers",
              "class_name": "l2",
              "config": {
                "l2": 0.001
              },
              "registered_name": null
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense_9/weight_0",
          "shape": [
            20,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_9/weight_1",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_6/weight_0",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_6/weight_1",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_6/weight_2",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_6/weight_3",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "latent/weight_0",
          "shape": [
            16,
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "latent/weight_1",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_10/weight_0",
          "shape": [
            8,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_10/weight_1",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_7/weight_0",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_7/weight_1",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_7/weight_2",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_7/weight_3",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_11/weight_0",
          "shape": [
            16,
            20
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_11/weight_1",
          "shape": [
            20
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}
