{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js v4.x Converter",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "class_name": "Functional",
    "config": {
      "name": "adult_asd_autoencoder",
      "trainable": true,
      "layers": [
        {
          "module": "keras.layers",
          "class_name": "InputLayer",
          "config": {
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "encoder_input",
            "batchInputShape": [
              null,
              28
            ]
          },
          "registered_name": null,
          "name": "encoder_input",
          "inbound_nodes": []
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "units": 32,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              28
            ]
          },
          "name": "dense",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      28
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "encoder_input",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {}
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              32
            ]
          },
          "name": "batch_normalization",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      32
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "dense",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {
                "mask": null
              }
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Dropout",
          "config": {
            "name": "dropout",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "rate": 0.4,
            "seed": null,
            "noise_shape": null
          },
          "registered_name": null,
          "name": "dropout",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      32
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "batch_normalization",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {
                "training": false
              }
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "units": 48,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              32
            ]
          },
          "name": "dense_1",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      32
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "dropout",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {}
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization_1",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              48
            ]
          },
          "name": "batch_normalization_1",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      48
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "dense_1",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {
                "mask": null
              }
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Dropout",
          "config": {
            "name": "dropout_1",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "rate": 0.4,
            "seed": null,
            "noise_shape": null
          },
          "registered_name": null,
          "name": "dropout_1",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      48
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "batch_normalization_1",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {
                "training": false
              }
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "latent",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "units": 24,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              48
            ]
          },
          "name": "latent",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      48
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "dropout_1",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {}
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "dense_2",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "units": 48,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              24
            ]
          },
          "name": "dense_2",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      24
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "latent",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {}
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization_2",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              48
            ]
          },
          "name": "batch_normalization_2",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      48
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "dense_2",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {
                "mask": null
              }
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Dropout",
          "config": {
            "name": "dropout_2",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "rate": 0.4,
            "seed": null,
            "noise_shape": null
          },
          "registered_name": null,
          "name": "dropout_2",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      48
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "batch_normalization_2",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {
                "training": false
              }
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "dense_3",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "units": 32,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              48
            ]
          },
          "name": "dense_3",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      48
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "dropout_2",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {}
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization_3",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              32
            ]
          },
          "name": "batch_normalization_3",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      32
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "dense_3",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {
                "mask": null
              }
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "dense_4",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "units": 28,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              32
            ]
          },
          "name": "dense_4",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      32
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "batch_normalization_3",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {}
            }
          ]
        }
      ],
      "input_layers": [
        "encoder_input",
        0,
        0
      ],
      "output_layers": [
        "dense_4",
        0,
        0
      ]
    },
    "keras_version": "3.12.0",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": [
        "weights.bin"
      ],
      "weights": [
        {
          "name": "dense/weight_0",
          "shape": [
            28,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/weight_1",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/weight_0",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/weight_1",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/weight_2",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/weight_3",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/weight_0",
          "shape": [
            32,
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/weight_1",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/weight_0",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/weight_1",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/weight_2",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/weight_3",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "latent/weight_0",
          "shape": [
            48,
            24
          ],
          "dtype": "float32"
        },
        {
          "name": "latent/weight_1",
          "shape": [
            24
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/weight_0",
          "shape": [
            24,
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/weight_1",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/weight_0",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/weight_1",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/weight_2",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/weight_3",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/weight_0",
          "shape": [
            48,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/weight_1",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_3/weight_0",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_3/weight_1",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_3/weight_2",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_3/weight_3",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_4/weight_0",
          "shape": [
            32,
            28
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_4/weight_1",
          "shape": [
            28
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}